docs/pyreverse/mermaid/classes_pythermondt.readers.mmd
classDiagram
  class AzureBlobReader {
    \_\_init\_\_(account_url: str, container_name: str, prefix: str, connection_string: str | None, credential: TokenCredential | None, num_files: int | None, download_files: bool, cache_files: bool, parser: type[BaseParser] | None)
  }
  style AzureBlobReader fill:#77AADD
  class BaseReader {
    backend : BaseBackend
    cache_files : bool
    download_files : bool
    files : list[str]
    manifest_path : str
    num_files : int | None
    parser : type[BaseParser] | None
    reader_cache_dir : str
    remote_source : bool
    \_\_getitem\_\_(idx: int) DataContainer
    \_\_getstate\_\_()
    \_\_init\_\_(num_files: int | None, download_files: bool, cache_files: bool, parser: type[BaseParser] | None)*
    \_\_iter\_\_() Iterator[DataContainer]
    \_\_len\_\_() int
    \_\_reversed\_\_() Iterator[DataContainer]
    \_\_setstate\_\_(state)
    \_\_str\_\_()
    download(file_paths: list[str] | None, num_workers: int | None) None
    read_file(file_path: str) DataContainer
  }
  style BaseReader fill:#77AADD
  class LocalReader {
    \_\_init\_\_(pattern: str, recursive: bool, num_files: int | None, cache_files: bool, parser: type[BaseParser] | None)
  }
  style LocalReader fill:#77AADD
  class S3Reader {
    \_\_init\_\_(bucket: str, prefix: str, region_name: str | None, profile_name: str | None, num_files: int | None, download_files: bool, cache_files: bool, parser: type[BaseParser] | None)
  }
  style S3Reader fill:#77AADD
  AzureBlobReader --|> BaseReader
  LocalReader --|> BaseReader
  S3Reader --|> BaseReader
